output/posts/blog_setup/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>orgmode + nikola setup your blog site | π</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://jas0nt.github.io/posts/blog_setup/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Jas0nt">
<meta property="og:site_name" content="π">
<meta property="og:title" content="orgmode + nikola setup your blog site">
<meta property="og:url" content="https://jas0nt.github.io/posts/blog_setup/">
<meta property="og:description" content="Nikola



Install Nikola

pip3 install Nikola[extras]





Install Nikola orgmode plugin

nikola plugin -i orgmode





Init Nikola site


In your github pages repo:

nikola init --demo


--demon opti">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-05-09T22:51:24+08:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://jas0nt.github.io/">

            <span id="blog-title">π</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">源文件</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">文章归档</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">标签</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS 源</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">orgmode + nikola setup your blog site</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Jas0nt
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-05-09T22:51:24+08:00" itemprop="datePublished" title="2020-05-09 22:51">2020-05-09 22:51</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">源文件</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgc6db029" class="outline-2">
<h2 id="orgc6db029">Nikola</h2>
<div class="outline-text-2" id="text-orgc6db029">
</div>
<div id="outline-container-orge0128ee" class="outline-3">
<h3 id="orge0128ee">Install Nikola</h3>
<div class="outline-text-3" id="text-orge0128ee">
<div class="highlight"><pre><span></span>pip3 install Nikola[extras]
</pre></div>
</div>
</div>

<div id="outline-container-org9904eef" class="outline-3">
<h3 id="org9904eef">Install Nikola orgmode plugin</h3>
<div class="outline-text-3" id="text-org9904eef">
<div class="highlight"><pre><span></span>nikola plugin -i orgmode
</pre></div>
</div>
</div>

<div id="outline-container-org520d3d9" class="outline-3">
<h3 id="org520d3d9">Init Nikola site</h3>
<div class="outline-text-3" id="text-org520d3d9">
<p>
In your github pages repo:
</p>
<div class="highlight"><pre><span></span>nikola init --demo
</pre></div>
<p>
<code>--demon</code> options is used to create some demo within the site.
</p>
</div>
</div>

<div id="outline-container-orgbc00e79" class="outline-3">
<h3 id="orgbc00e79">emacs-htmlize</h3>
<div class="outline-text-3" id="text-orgbc00e79">
<p>
Need to install the emacs-htmlize package for converting org file to html.
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">use-package</span> <span class="nv">htmlize</span> <span class="nv">:ensre</span> <span class="nv">t</span><span class="p">)</span>
</pre></div>
</div>
</div>

<div id="outline-container-org45e1037" class="outline-3">
<h3 id="org45e1037">new post</h3>
<div class="outline-text-3" id="text-org45e1037">
<div class="highlight"><pre><span></span>nikola new_post posts/my_first_post.org
</pre></div>
<p>
Write your content in the org file.
</p>
</div>
</div>

<div id="outline-container-org242f81c" class="outline-3">
<h3 id="org242f81c">build and preview</h3>
<div class="outline-text-3" id="text-org242f81c">
<div class="highlight"><pre><span></span>nikola build
nikola auto --browser
</pre></div>
<p>
When you are done writing, you should <code>nikola build</code> your site before <code>deploy</code>.
<code>nikola auto</code> will start the development server for development only, <code>--browser</code> option will open <a href="http://127.0.0.1:8000/">http://127.0.0.1:8000/</a> in the default web browser.
</p>
</div>
</div>

<div id="outline-container-org3403e11" class="outline-3">
<h3 id="org3403e11">deploy</h3>
<div class="outline-text-3" id="text-org3403e11">
<p>
Deploy your glog to github pages.
</p>
<div class="highlight"><pre><span></span>nikola github_deploy
</pre></div>


<p>
All set, enjoy writing.
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2020         <a href="mailto:taoeta@gmail.com">Jas0nt</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
